app/controllers/microposts_controller.rb

	def create
		@micropost = current_user.microposts.build(params[:micropost])
		if @micropost.save
---
INSERT INTO "microposts" ("user_id", "content", "updated_at", "created_at") VALUES(1, 'aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa', '2014-02-19 11:00:38', '2014-02-19 11:00:38')

	def destroy
		@micropost.destroy
---
DELETE FROM "microposts" WHERE "id" = 301