app/controllers/users_controller.rb

	def show
		@user  = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "microposts" WHERE ("microposts".user_id = 1) ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "microposts" WHERE ("microposts".user_id = 1)

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def create
  	@user =User.new(params[:user])
  	if @user.save
---
INSERT INTO "users" ("name", "updated_at", "salt", "admin", "encrypted_password", "email", "remember_token", "created_at") VALUES('Nike', '2014-02-19 10:23:32', '5a43009d619febad21794f47225a51a8b0558a6098c8780bbb655499b9fd4c89', 'f', 'db624dc27be4be9baf7af8b862b16b351706a01388c137e484d4f4993b3f1b14', 'nike@gmail.com', NULL, '2014-02-19 10:23:32')

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "id" = 2
SELECT * FROM "users" WHERE ("users"."id" = 2)